app/Controllers/Home.php

SELECT *
FROM `user`
WHERE `id` = '6'
---

            // Refer Id
            if($refer_id != '-'){
                $data['refer_id'] = $this->datatable->getwhere(['id' => $refer_id])->getRow()->user_id;